hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
  if (runtimeAesKey.length() == 0) {
    runtimeAesKey = "SmartPonic123456";
    Serial.println("WARNING: Using default AES key - set custom key with SETKEYS command");
  }
  if (runtimeAuthKey.length() == 0) {
    runtimeAuthKey = "AQUA77";
    Serial.println("WARNING: Using default Auth key - set custom key with SETKEYS command");
  }

  Serial.println("Secure keys loaded from flash storage");
  Serial.print("AES key configured: ");
  Serial.println(runtimeAesKey.length() > 0 ? "YES" : "NO");
  Serial.print("Auth key configured: ");
  Serial.println(runtimeAuthKey.length() > 0 ? "YES" : "NO");
}

bool saveAesKey(const String &value) {
  if (value.length() != 16) {
    Serial.println("ERROR: AES key must be exactly 16 characters");
    return false;
  }
  prefs.begin("secrets", false);
  prefs.putString(aesKeyPrefKey, value);
  prefs.end();
  runtimeAesKey = value;
  Serial.println("AES key saved to flash storage");
  return true;
}

bool saveAuthKey(const String &value) {
  if (value.length() == 0 || value.length() > 64) {
    Serial.println("ERROR: Auth key must be 1-64 characters");
    return false;
  }
  prefs.begin("secrets", false);
  prefs.putString(authKeyPrefKey, value);
  prefs.end();
  runtimeAuthKey = value;
  Serial.println("Auth key saved to flash storage");
  return true;
}

bool clearSecureKeys() {
  prefs.begin("secrets", false);
  prefs.remove(aesKeyPrefKey);
  prefs.remove(authKeyPrefKey);
  prefs.end();
  runtimeAesKey = "SmartPonic123456";
  runtimeAuthKey = "AQUA77";
  Serial.println("Secure keys cleared - using defaults");
  return true;
}

String readRequestSecurityKey() {
  String requestKey;

  if (server.hasHeader(nodeKeyHeader)) {
    requestKey = server.header(nodeKeyHeader);
  }

  if (requestKey.isEmpty() && server.hasArg("key")) {
    requestKey = server.arg("key");
  }

  requestKey.trim();
  return requestKey;
}

bool requireAuthorizedNodeKey(bool allowBootstrap) {
  String requestKey = readRequestSecurityKey();
  String nodeKey = loadNodeSecurityKey();

  if (requestKey.isEmpty()) {
    addCommonHeaders();
    server.send(
        401,
        "application/json",
        "{\"status\":\"missing_key\",\"message\":\"Security key required\"}");
    return false;
  }

  if (nodeKey.isEmpty()) {
    if (allowBootstrap) {
      return true;
    }

    addCommonHeaders();
    server.send(
        403,
        "application/json",
        "{\"status\":\"key_not_configured\",\"message\":\"Set a key with a deploy request first\"}");
    return false;
  }

  if (requestKey != nodeKey) {
    addCommonHeaders();
    server.send(
        403,
        "application/json",
        "{\"status\":\"invalid_key\",\"message\":\"Security key mismatch\"}");
    return false;
  }

  return true;
}

// ADD THIS: sensor/communication prioritization helpers
uint8_t escalatePriority(uint8_t current, uint8_t candidate) {
  return candidate > current ? candidate : current;
}

uint8_t classifySensorPriority(const String &sensorName, const String &rawValue) {
  String trimmed = rawValue;
  trimmed.trim();

  if ((sensorName == "Temperature" || sensorName == "Humidity") && trimmed.equalsIgnoreCase("nan")) {
    return SmartPacket::PRIORITY_HIGH;
  }

  if (sensorName == "WaterTemp" && trimmed.toFloat() == -127.0f) {
    return SmartPacket::PRIORITY_HIGH;
  }

  if (!trimmed.equalsIgnoreCase("nan")) {
    const float value = trimmed.toFloat();

    if (sensorName == "Temperature") {
      if (value < 18.0f || value > 35.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 22.0f || value > 32.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Humidity") {
      if (value < 30.0f || value > 90.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 40.0f || value > 80.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "WaterTemp") {
      if (value < 15.0f || value > 32.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 20.0f || value > 30.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "pH") {
      if (value < 5.5f || value > 8.5f) return SmartPacket::PRIORITY_HIGH;
      if (value < 6.0f || value > 8.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "TDS") {
      if (value > 1200.0f) return SmartPacket::PRIORITY_HIGH;
      if (value > 800.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Turbidity") {
      if (value > 1000.0f) return SmartPacket::PRIORITY_HIGH;
      if (value > 300.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Rain") {
      if ((int) value == 1) return SmartPacket::PRIORITY_MEDIUM;
    }
  }

  return SmartPacket::PRIORITY_LOW;
}

void updateReportMode(uint8_t priority) {
  currentPriority = priority;

  if (priority == SmartPacket::PRIORITY_HIGH) {
    currentReportMode = SmartPacket::REPORT_MODE_CRITICAL;
    currentReportIntervalMs = REPORT_INTERVAL_CRITICAL_MS;
    criticalDispatchPending = true;
  } else if (priority == SmartPacket::PRIORITY_MEDIUM) {
    currentReportMode = SmartPacket::REPORT_MODE_ABNORMAL;
    currentReportIntervalMs = REPORT_INTERVAL_ABNORMAL_MS;
  } else {
    currentReportMode = SmartPacket::REPORT_MODE_NORMAL;
    currentReportIntervalMs = REPORT_INTERVAL_NORMAL_MS;
  }
}

String canonicalSensorName(String sensor) {
  sensor.trim();
  String normalized = sensor;
  normalized.toUpperCase();

  if (normalized == "DHT22") return "DHT22";
  if (normalized == "WATERTEMP") return "WaterTemp";
  if (normalized == "PH") return "pH";
  if (normalized == "TDS") return "TDS";
  if (normalized == "TURBIDITY") return "Turbidity";
  if (normalized == "RAIN") return "Rain";

  return sensor;
}

// ================= CONFIG LOGIC =================

void applyConfig(JsonArray arr) {
  for (int i = 0; i < MAX_SENSORS; i++) {
    if (dhtSensors[i]) {
      delete dhtSensors[i];
      dhtSensors[i] = nullptr;
    }
    if (tempSensors[i]) {
      delete tempSensors[i];
      tempSensors[i] = nullptr;
      delete oneWireSensors[i];
      oneWireSensors[i] = nullptr;
    } else if (oneWireSensors[i]) {
      delete oneWireSensors[i];
      oneWireSensors[i] = nullptr;
    }
  }

  configList.clear();
  int idx = 0;

  for (JsonObject obj : arr) {
    if (idx >= MAX_SENSORS) {
      break;
    }

    int pin = obj["pin"] | -1;
    String sensor = canonicalSensorName(obj["sensor"] | "");
    String type = obj["type"] | "";
    String label = obj["label"] | "";
    label.trim();

