hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
    if (!isSafePin(pin)) {
      continue;
    }

    bool duplicate = false;
    for (size_t existingIndex = 0; existingIndex < configList.size(); existingIndex++) {
      if (configList[existingIndex].pin == pin && configList[existingIndex].sensor == sensor && configList[existingIndex].type == type) {
        duplicate = true;
        break;
      }
    }
    if (duplicate) {
      continue;
    }

    configList.push_back({pin, type, sensor, label});

    if (sensor == "DHT22") {
      dhtSensors[idx] = new DHT(pin, DHT22);
      dhtSensors[idx]->begin();
    } else if (sensor == "WaterTemp") {
      oneWireSensors[idx] = new OneWire(pin);
      tempSensors[idx] = new DallasTemperature(oneWireSensors[idx]);
      tempSensors[idx]->begin();
    }

    if (type == "DO") {
      pinMode(pin, OUTPUT);
    } else {
      pinMode(pin, INPUT);
    }

    Serial.print("Configured GPIO ");
    Serial.print(pin);
    Serial.print(" as ");
    if (!label.isEmpty()) {
      Serial.print(label);
      Serial.print(" ");
    }
    Serial.print(sensor);
    Serial.print(" [");
    Serial.print(type);
    Serial.println("]");

    idx++;
  }
}

void loadRuntimeSettingsFromDocument(JsonDocument &doc) {
  runtimeSettings.latitude = doc["latitude"] | runtimeSettings.latitude;
  runtimeSettings.longitude = doc["longitude"] | runtimeSettings.longitude;
  runtimeSettings.distanceMeters = doc["distance"] | runtimeSettings.distanceMeters;
}

void handleRoot() {
  Serial.println("HTTP GET /");
  addCommonHeaders();

  String html =
      "<!doctype html><html><head><meta name='viewport' "
      "content='width=device-width,initial-scale=1'>"
      "<title>SmartPonic Node</title>"
      "<style>"
      "body{font-family:Arial,sans-serif;background:#f5f8f5;color:#17312a;"
      "padding:24px;line-height:1.5;}"
      ".card{max-width:560px;background:#ffffff;border-radius:20px;"
      "padding:20px;box-shadow:0 14px 30px rgba(23,49,42,0.10);}"
      "code{background:#eef4ef;padding:2px 6px;border-radius:8px;}"
      "a{color:#0d7a49;text-decoration:none;font-weight:600;}"
      "h1{margin:0 0 10px;font-size:28px;}"
      "p{margin:8px 0;}"
      "ul{padding-left:18px;}"
      "</style></head><body><div class='card'>"
      "<h1>SmartPonic Node</h1>"
      "<p>Wi-Fi AP is running and the local web server is alive.</p>"
      "<p><strong>SSID:</strong> <code>" +
      String(ssid) +
      "</code></p>"
      "<p><strong>IP:</strong> <code>" +
      WiFi.softAPIP().toString() +
      "</code></p>"
      "<p><strong>Locked:</strong> <code>" +
      String(loadNodeSecurityKey().isEmpty() ? "no" : "yes") +
      "</code></p>"
      "<p><strong>Hardware ID:</strong> <code>" +
      runtimeHardwareId +
      "</code></p>"
      "<p><strong>Distance:</strong> <code>" +
      String(runtimeSettings.distanceMeters, 1) +
      " m</code></p>"
      "<p><strong>Clients:</strong> <code>" +
      String(WiFi.softAPgetStationNum()) +
      "</code></p>"
      "<ul>"
      "<li><a href='/health'>/health</a> for quick JSON status</li>"
      "<li><a href='/config'>/config</a> for saved config JSON</li>"
      "</ul>"
      "</div></body></html>";

  server.send(200, "text/html", html);
}

void handleHealth() {
  Serial.println("HTTP GET /health");
  addCommonHeaders();

  const uint32_t freeHeapKb = ESP.getFreeHeap() / 1024;
  const uint32_t uptimeSec = millis() / 1000;
  String body = "{\"status\":\"ok\",\"ssid\":\"" + String(ssid) +
                "\",\"ip\":\"" + WiFi.softAPIP().toString() +
                "\",\"board\":\"" + boardName() +
                "\",\"chipModel\":\"" + String(ESP.getChipModel()) +
                "\",\"chipRevision\":" + String(ESP.getChipRevision()) +
                ",\"hardwareId\":\"" + runtimeHardwareId + "\"" +
                ",\"heapKb\":" + String(freeHeapKb) +
                ",\"uptimeSec\":" + String(uptimeSec) +
                ",\"locked\":" +
                String(loadNodeSecurityKey().isEmpty() ? "false" : "true") +
                ",\"clients\":" + String(WiFi.softAPgetStationNum()) +
                ",\"configCount\":" + String(configList.size()) +
                ",\"maxConfig\":" + String(MAX_SENSORS) +
                ",\"latitude\":" + String(runtimeSettings.latitude, 6) +
                ",\"longitude\":" + String(runtimeSettings.longitude, 6) +
                ",\"distance\":" + String(runtimeSettings.distanceMeters, 1) +
                ",\"priority\":\"" + SmartPacket::priorityLabel(currentPriority) + "\"" +
                ",\"reportMode\":\"" + SmartPacket::reportModeLabel(currentReportMode) + "\"" +
                ",\"pendingQueue\":" + String(pendingPackets.size()) + "}";

  server.send(200, "application/json", body);
}

void handleOptions() {
  Serial.println("HTTP OPTIONS /config");
  addCommonHeaders();
  server.send(200, "text/plain", "");
}

void handleGetConfig() {
  Serial.println("HTTP GET /config");
  if (!requireAuthorizedNodeKey(false)) {
    return;
  }

  prefs.begin(configNamespace, true);
  String json = prefs.getString(configJsonPrefKey, "{\"config\":[]}");
  prefs.end();

  addCommonHeaders();
  server.send(200, "application/json", json);
}

void handlePostConfig() {
  Serial.println("HTTP POST /config");
  if (!requireAuthorizedNodeKey(true)) {
    return;
  }

  addCommonHeaders();

  if (!server.hasArg("plain")) {
    server.send(400, "application/json", "{\"status\":\"no body\"}");
    return;
  }

  String body = server.arg("plain");
  Serial.println("Received new config from app:");
  Serial.println(body);

  DynamicJsonDocument doc(4096);
  DeserializationError error = deserializeJson(doc, body);

  if (error) {
    Serial.print("JSON parse failed: ");
    Serial.println(error.f_str());
    server.send(400, "application/json", "{\"status\":\"parse error\"}");
    return;
  }

  if (!doc.containsKey("config")) {
    server.send(400, "application/json", "{\"status\":\"missing config key\"}");
    return;
  }

  loadRuntimeSettingsFromDocument(doc);
  JsonArray arr = doc["config"];
  applyConfig(arr);
  metadataSyncPending = true;

  prefs.begin(configNamespace, false);
  prefs.putString(configJsonPrefKey, body);
  prefs.end();

  String nodeKey = loadNodeSecurityKey();
  if (nodeKey.isEmpty()) {
    saveNodeSecurityKey(readRequestSecurityKey());
    Serial.println("Security key saved to node.");
  }

  // Handle secure keys from Flutter deploy payload
  if (doc.containsKey("keys") && doc["keys"].is<JsonObject>()) {
    JsonObject keysObj = doc["keys"];
    if (keysObj.containsKey("aes128") && keysObj["aes128"].is<const char*>()) {
      String aesKey = keysObj["aes128"].as<String>();
      if (saveAesKey(aesKey)) {
        Serial.println("AES key updated from deploy payload");
      }
    }
    if (keysObj.containsKey("auth") && keysObj["auth"].is<const char*>()) {
      String authKey = keysObj["auth"].as<String>();
      if (saveAuthKey(authKey)) {
        Serial.println("Auth key updated from deploy payload");
      }
    }
  }

