hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
  Serial.println("Config applied and saved to flash.");
  server.send(200, "application/json", "{\"status\":\"ok\"}");
}

void handleNotFound() {
  Serial.print("HTTP 404: ");
  Serial.println(server.uri());
  addCommonHeaders();
  server.send(
      404,
      "application/json",
      "{\"status\":\"not found\",\"hint\":\"use /, /health or /config\"}");
}

// ================= LORA & SMART COMMUNICATION =================

void appendSegment(std::vector<SensorSegment> &segments, int pin, const String &sensorName, const String &rawValue) {
  SensorSegment segment;
  segment.pin = pin;
  segment.sensorName = sensorName;
  segment.rawValue = rawValue;
  segment.segment = String(pin) + "=" + sensorName + "=" + rawValue;
  segments.push_back(segment);
}

void sampleSensors() {
  std::vector<SensorSegment> sampledSegments;
  uint8_t highestPriority = SmartPacket::PRIORITY_LOW;

  // Track which sensor slot we're using (separate from configList index)
  int sensorSlot = 0;

  for (size_t i = 0; i < configList.size(); i++) {
    auto c = configList[i];

    // Skip if sensor not properly initialized in this slot
    if (sensorSlot >= MAX_SENSORS) {
      break;
    }

    if (c.sensor == "DHT22" && dhtSensors[sensorSlot]) {
      float temp = dhtSensors[sensorSlot]->readTemperature();
      float humidity = dhtSensors[sensorSlot]->readHumidity();
      String tempValue = isnan(temp) ? "nan" : String(temp, 1);
      String humidityValue = isnan(humidity) ? "nan" : String(humidity, 1);

      appendSegment(sampledSegments, c.pin, "Temperature", tempValue);
      appendSegment(sampledSegments, c.pin, "Humidity", humidityValue);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Temperature", tempValue));
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Humidity", humidityValue));
    } else if (c.sensor == "WaterTemp" && tempSensors[sensorSlot]) {
      tempSensors[sensorSlot]->requestTemperatures();
      String value = String(tempSensors[sensorSlot]->getTempCByIndex(0), 1);
      appendSegment(sampledSegments, c.pin, "WaterTemp", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("WaterTemp", value));
    } else if (c.sensor == "pH") {
      String value = String(readPH(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "pH", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("pH", value));
    } else if (c.sensor == "TDS") {
      String value = String(readTDS(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "TDS", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("TDS", value));
    } else if (c.sensor == "Turbidity") {
      String value = readTurbidity(analogRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Turbidity", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Turbidity", value));
    } else if (c.sensor == "Rain") {
      String value = String(digitalRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Rain", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Rain", value));
    }

    sensorSlot++;
  }

  latestSegments = sampledSegments;
  updateReportMode(highestPriority);
}

String buildPlainPayload(uint8_t priority, uint8_t reportMode) {
  String payload = "auth=" + runtimeAuthKey + "&";

  for (size_t i = 0; i < latestSegments.size(); i++) {
    payload += latestSegments[i].segment + "&";
  }

  payload += "hardware_id=" + runtimeHardwareId;
  payload += "&priority=" + SmartPacket::priorityLabel(priority);
  payload += "&mode=" + SmartPacket::reportModeLabel(reportMode);
  payload += "&sample_ms=" + String(SAMPLE_INTERVAL_MS);
  payload += "&report_ms=" + String(currentReportIntervalMs);
  return payload;
}

String buildLocationSyncPayload() {
  String payload = "auth=" + runtimeAuthKey;
  payload += "&meta=location";
  payload += "&hardware_id=" + runtimeHardwareId;
  payload += "&lat=" + String(runtimeSettings.latitude, 6);
  payload += "&lon=" + String(runtimeSettings.longitude, 6);
  payload += "&distance=" + String(runtimeSettings.distanceMeters, 1);
  return payload;
}

void fillNonce(uint8_t nonce[SmartPacket::NONCE_SIZE]) {
  memset(nonce, 0, SmartPacket::NONCE_SIZE);
  uint32_t now = millis();
  uint32_t randomValue = esp_random();
  memcpy(nonce + 4, &now, sizeof(now));
  memcpy(nonce + 8, &randomValue, sizeof(randomValue));
  // Nonce bytes 12-15: random data for uniqueness
  uint32_t randomPad = esp_random();
  memcpy(nonce + 12, &randomPad, sizeof(randomPad));
}

std::vector<uint8_t> encryptCtrPayload(const String &plainText, const uint8_t nonce[SmartPacket::NONCE_SIZE]) {
  std::vector<uint8_t> output(plainText.length(), 0);
  std::vector<uint8_t> nonceCounter(SmartPacket::NONCE_SIZE, 0);
  memcpy(nonceCounter.data(), nonce, SmartPacket::NONCE_SIZE);

  size_t ncOffset = 0;
  unsigned char streamBlock[16] = {0};

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, reinterpret_cast<const unsigned char *>(runtimeAesKey.c_str()), 128);
  mbedtls_aes_crypt_ctr(
      &aes,
      plainText.length(),
      &ncOffset,
      nonceCounter.data(),
      streamBlock,
      reinterpret_cast<const unsigned char *>(plainText.c_str()),
      output.data());
  mbedtls_aes_free(&aes);

  return output;
}

std::vector<uint8_t> buildStructuredPacket(const String &plainText, uint8_t priority, uint8_t reportMode) {
  uint8_t nonce[SmartPacket::NONCE_SIZE];
  fillNonce(nonce);
  std::vector<uint8_t> encryptedPayload = encryptCtrPayload(plainText, nonce);

  SmartPacket::Header header;
  header.magic = SmartPacket::MAGIC;
  header.version = SmartPacket::VERSION;
  header.priority = priority;
  header.reportMode = reportMode;
  header.payloadLength = (uint16_t) encryptedPayload.size();

  size_t bodyLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + encryptedPayload.size();
  std::vector<uint8_t> packet(bodyLength + sizeof(uint32_t), 0);
  size_t offset = 0;

  memcpy(packet.data() + offset, &header, sizeof(header));
  offset += sizeof(header);
  memcpy(packet.data() + offset, nonce, SmartPacket::NONCE_SIZE);
  offset += SmartPacket::NONCE_SIZE;
  memcpy(packet.data() + offset, encryptedPayload.data(), encryptedPayload.size());
  offset += encryptedPayload.size();

  uint32_t checksum = SmartPacket::crc32(packet.data(), offset);
  memcpy(packet.data() + offset, &checksum, sizeof(checksum));
  return packet;
}

void configureLoRaRadio() {
  LoRa.setSyncWord(LORA_SYNC_WORD);
  LoRa.setSpreadingFactor(9);
  LoRa.setSignalBandwidth(125E3);
  LoRa.setCodingRate4(5);
  LoRa.setPreambleLength(12);
  LoRa.enableCrc();
  LoRa.setTxPower(20);

