hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
  LoRa.dumpRegisters(Serial);
}

// Fixed TX→RX turnaround: SX1278 requires ~15-20ms after endPacket() before RX is ready
bool sendBinaryPacket(const std::vector<uint8_t> &packetBytes) {
  if (!loraReady) {
    Serial.println("LoRa not ready - cannot send");
    return false;
  }

  LoRa.beginPacket();
  size_t written = LoRa.write(packetBytes.data(), packetBytes.size());
  int result = LoRa.endPacket();
  // CRITICAL FIX: Wait 20ms for SX1278 TX→RX transition stabilization
  delay(20);
  LoRa.receive();
  return written == packetBytes.size() && result == 1;
}

String getFieldValue(const String &data, const String &key) {
  int start = 0;
  const String prefix = key + "=";
  while (true) {
    int amp = data.indexOf('&', start);
    if (amp == -1) amp = data.length();

    String segment = data.substring(start, amp);
    if (segment.startsWith(prefix)) {
      return segment.substring(prefix.length());
    }

    if (amp >= data.length()) break;
    start = amp + 1;
  }
  return "";
}

bool decryptStructuredPacket(const std::vector<uint8_t> &input, SmartPacket::Header &header, String &payload) {
  const size_t minimumLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + sizeof(uint32_t);
  if (input.size() < minimumLength) {
    return false;
  }

  memcpy(&header, input.data(), sizeof(SmartPacket::Header));
  if (header.magic != SmartPacket::MAGIC || header.version != SmartPacket::VERSION) {
    return false;
  }

  const size_t expectedLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + header.payloadLength + sizeof(uint32_t);
  if (input.size() != expectedLength) {
    return false;
  }

  const size_t checksumOffset = input.size() - sizeof(uint32_t);
  uint32_t receivedChecksum = 0;
  memcpy(&receivedChecksum, input.data() + checksumOffset, sizeof(receivedChecksum));
  uint32_t calculatedChecksum = SmartPacket::crc32(input.data(), checksumOffset);
  if (receivedChecksum != calculatedChecksum) {
    return false;
  }

  const uint8_t *nonce = input.data() + sizeof(SmartPacket::Header);
  const unsigned char *encryptedPayload = input.data() + sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE;

  std::vector<unsigned char> output(header.payloadLength, 0);
  std::vector<unsigned char> nonceCounter(SmartPacket::NONCE_SIZE, 0);
  memcpy(nonceCounter.data(), nonce, SmartPacket::NONCE_SIZE);
  size_t ncOffset = 0;
  unsigned char streamBlock[16] = {0};

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, reinterpret_cast<const unsigned char *>(runtimeAesKey.c_str()), 128);
  mbedtls_aes_crypt_ctr(
      &aes,
      header.payloadLength,
      &ncOffset,
      nonceCounter.data(),
      streamBlock,
      encryptedPayload,
      output.data());
  mbedtls_aes_free(&aes);

  payload = "";
  for (size_t i = 0; i < output.size(); i++) {
    payload += (char) output[i];
  }
  payload.trim();
  return payload.length() > 0;
}

void handleIncomingControl() {
  if (!loraReady) return;

  int packetSize = LoRa.parsePacket();
  if (packetSize <= 0) return;

  std::vector<uint8_t> received(packetSize, 0);
  LoRa.readBytes(received.data(), packetSize);

  SmartPacket::Header header = {};
  String decrypted;
  if (!decryptStructuredPacket(received, header, decrypted)) {
    return;
  }

  if (getFieldValue(decrypted, "auth") != runtimeAuthKey) {
    return;
  }

  if (getFieldValue(decrypted, "cmd") != "relay") {
    return;
  }

  int relayId = getFieldValue(decrypted, "relay").toInt();
  int state = getFieldValue(decrypted, "state").toInt();
  uint32_t commandId = (uint32_t) getFieldValue(decrypted, "command_id").toInt();

  // Relay mapping: relay_id is the index of configured DO pins (sorted by pin).
  std::vector<int> relayPins;
  for (size_t i = 0; i < configList.size(); i++) {
    if (configList[i].type == "DO") {
      relayPins.push_back(configList[i].pin);
    }
  }
  std::sort(relayPins.begin(), relayPins.end());

  String status = "failed";
  String message = "relay not found";
  int appliedPin = -1;
  if (relayId >= 0 && relayId < (int) relayPins.size()) {
    appliedPin = relayPins[(size_t) relayId];
    pinMode(appliedPin, OUTPUT);
    digitalWrite(appliedPin, state ? HIGH : LOW);
    status = "done";
    message = "ok";
  }

  String ack = "auth=" + runtimeAuthKey;
  ack += "&ack=relay";
  ack += "&hardware_id=" + runtimeHardwareId;
  ack += "&command_id=" + String(commandId);
  ack += "&status=" + status;
  ack += "&relay=" + String(relayId);
  ack += "&pin=" + String(appliedPin);
  ack += "&state=" + String(state ? 1 : 0);
  ack += "&msg=" + message;

  std::vector<uint8_t> ackPacket = buildStructuredPacket(
      ack,
      SmartPacket::PRIORITY_HIGH,
      SmartPacket::REPORT_MODE_ABNORMAL);
  sendBinaryPacket(ackPacket);
}

void enqueuePendingPacket(const std::vector<uint8_t> &packetBytes, uint8_t priority, uint8_t reportMode) {
  if (pendingPackets.size() >= MAX_PENDING_PACKETS) {
    pendingPackets.erase(pendingPackets.begin());
  }

  PendingPacket packet{packetBytes, priority, reportMode, millis()};
  if (priority == SmartPacket::PRIORITY_HIGH) {
    pendingPackets.insert(pendingPackets.begin(), packet);
  } else {
    pendingPackets.push_back(packet);
  }
}

void retryPendingPacketsIfNeeded() {
  if (pendingPackets.empty() || millis() - lastRetryMs < RETRY_INTERVAL_MS) {
    return;
  }

  lastRetryMs = millis();
  PendingPacket packet = pendingPackets.front();
  if (sendBinaryPacket(packet.bytes)) {
    Serial.println("Retried queued packet successfully.");
    pendingPackets.erase(pendingPackets.begin());
  } else {
    Serial.println("Queued packet retry failed.");
  }
}

void sendCurrentTelemetry(bool forceImmediate) {
  if (latestSegments.empty()) {
    return;
  }

  bool intervalElapsed = (millis() - lastReportMs) >= currentReportIntervalMs;
  if (!forceImmediate && !intervalElapsed) {
    return;
  }

  if (runtimeHardwareId.length() == 0) {
    Serial.println("ERROR: hardware_id is empty! Cannot send telemetry.");
    return;
  }
  String plainText = buildPlainPayload(currentPriority, currentReportMode);
  Serial.println("Plain payload preview: " + plainText.substring(0, min(150, (int)plainText.length())));
  std::vector<uint8_t> packetBytes = buildStructuredPacket(plainText, currentPriority, currentReportMode);

  if (sendBinaryPacket(packetBytes)) {
    lastReportMs = millis();
    criticalDispatchPending = false;
    Serial.println("\n========== LORA PACKET ==========");
    Serial.print("Priority: ");
    Serial.println(SmartPacket::priorityLabel(currentPriority));
    Serial.print("Report mode: ");
    Serial.println(SmartPacket::reportModeLabel(currentReportMode));
    Serial.print("Payload length: ");
    Serial.println(plainText.length());
    Serial.print("Packet length: ");
    Serial.println(packetBytes.size());
    Serial.println("Packet sent securely.");
    Serial.println("=================================\n");
  } else {
    Serial.println("LoRa send failed. Queueing packet.");
    enqueuePendingPacket(packetBytes, currentPriority, currentReportMode);
  }
}

