hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
void sendLocationSyncIfNeeded() {
  if (!metadataSyncPending) {
    return;
  }

  String payload = buildLocationSyncPayload();
  std::vector<uint8_t> packetBytes = buildStructuredPacket(
      payload,
      SmartPacket::PRIORITY_LOW,
      SmartPacket::REPORT_MODE_NORMAL);

  if (sendBinaryPacket(packetBytes)) {
    metadataSyncPending = false;
    Serial.println("Location sync packet sent after config update.");
  } else {
    enqueuePendingPacket(packetBytes, SmartPacket::PRIORITY_LOW, SmartPacket::REPORT_MODE_NORMAL);
    Serial.println("Location sync packet queued for retry.");
  }
}

// ================= SENSOR CALIBRATION FUNCTIONS =================
// These are default calibration values - adjust based on your sensor

// pH Sensor Calibration
// Default: Neutral pH7 = 1500 raw, Acid pH4 = 1000 raw, Alkaline pH10 = 2000 raw
// Formula: pH = ((raw - neutralRaw) / slope) + 7
float readPH(int raw) {
  // ESP32 ADC: 0-4095, typically pH7 reads around half (2048)
  // Calibration values - adjust these for your sensor!
  const float neutralRaw = 1500.0;  // Raw value at pH 7
  const float slope = 250.0;       // Raw change per pH unit

  float ph = ((raw - neutralRaw) / slope) + 7.0;

  // Clamp to valid range
  if (ph < 0) ph = 0;
  if (ph > 14) ph = 14;

  return ph;
}

// TDS Sensor Calibration
// Default: 0 raw = 0 PPM, 4095 raw = ~2000 PPM
// Formula: PPM = (raw / 4095.0) * 2000 * multiplier
float readTDS(int raw) {
  // Typical conversion: 1 unit ADC ~ 0.5 PPM
  // For 0-4095 ADC range mapping to 0-2000 PPM
  const float multiplier = 0.5;

  float tds = (raw / 4095.0) * 2000.0 * multiplier;

  return tds;
}

// Turbidity Sensor
// Returns NTU value and status text
String readTurbidity(int raw) {
  // ESP32: 0 = clear (high voltage), 4095 = murky (low voltage)
  // Map raw ADC to NTU (Nephelometric Turbidity Units)
  // Typical: 0 ADC = ~0 NTU (clear), 4095 ADC = ~3000 NTU (very murky)

  const float maxNTU = 3000.0;
  float ntu = ((float)raw / 4095.0) * maxNTU;

  // Return formatted string: "123.5" or use the helper below
  // For app compatibility, we'll return just the NTU value as string
  // The app can then display as "Clear" if < 10, "Murky" if > 100, etc.
  return String(ntu, 1);
}

// Alternative: Get turbidity status string
String getTurbidityStatus(int raw) {
  float ntu = ((float)raw / 4095.0) * 3000.0;

  if (ntu < 10) return "Clear";
  else if (ntu < 50) return "Slightly Cloudy";
  else if (ntu < 100) return "Cloudy";
  else if (ntu < 500) return "Murky";
  else return "Very Murky";
}

void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println();
  Serial.println("BOOT OK");
  Serial.println("Starting SmartPonic node...");
  runtimeHardwareId = getHardwareId();
  Serial.println("Hardware ID: " + runtimeHardwareId);

  for (int i = 0; i < MAX_SENSORS; i++) {
    dhtSensors[i] = nullptr;
    oneWireSensors[i] = nullptr;
    tempSensors[i] = nullptr;
  }
  Serial.println("Sensor slots initialized");

  IPAddress localIp(192, 168, 4, 1);
  IPAddress gateway(192, 168, 4, 1);
  IPAddress subnet(255, 255, 255, 0);
  const char *headerKeys[] = {nodeKeyHeader};

  WiFi.mode(WIFI_AP);
  if (!WiFi.softAPConfig(localIp, gateway, subnet)) {
    Serial.println("AP IP config failed");
  }

  bool apReady = WiFi.softAP(ssid, password);
  Serial.print("Access Point status: ");
  Serial.println(apReady ? "ready" : "failed");
  Serial.print("Access Point SSID: ");
  Serial.println(ssid);
  Serial.print("Access Point IP: ");
  Serial.println(WiFi.softAPIP());

  prefs.begin(configNamespace, true);
  String savedJson = prefs.getString(configJsonPrefKey, "");
  prefs.end();
  Serial.print("Saved config bytes: ");
  Serial.println(savedJson.length());
  Serial.print("Node security key configured: ");
  Serial.println(loadNodeSecurityKey().isEmpty() ? "no" : "yes");

  // Load AES and Auth keys from secure flash storage
  loadSecureKeys();

  if (savedJson != "") {
    DynamicJsonDocument doc(4096);
    DeserializationError error = deserializeJson(doc, savedJson);
    if (error) {
      Serial.print("Saved config parse failed: ");
      Serial.println(error.f_str());
    } else if (doc.containsKey("config")) {
      loadRuntimeSettingsFromDocument(doc);
      applyConfig(doc["config"]);
      Serial.println("Saved config applied");
    }
  }

  server.on("/", HTTP_GET, handleRoot);
  server.on("/health", HTTP_GET, handleHealth);
  server.collectHeaders(headerKeys, 1);
  server.on("/config", HTTP_OPTIONS, handleOptions);
  server.on("/config", HTTP_POST, handlePostConfig);
  server.on("/config", HTTP_GET, handleGetConfig);
  server.onNotFound(handleNotFound);
  server.begin();
  Serial.println("HTTP config server started");
  Serial.println("Open http://192.168.4.1/ in your browser");

  SPI.begin(LORA_SCK, LORA_MISO, LORA_MOSI, LORA_SS);
  LoRa.setPins(LORA_SS, LORA_RST, LORA_DIO0);
  loraReady = LoRa.begin(433E6);
  if (loraReady) {
    configureLoRaRadio();
    LoRa.receive();
    Serial.println("System Ready");
  } else {
    Serial.println("LoRa init failed");
  }

  // ADD THIS: start with an immediate sample so the first report has fresh data
  sampleSensors();
}

void loop() {
  server.handleClient();
  handleIncomingControl();

  if (millis() - lastSampleMs >= SAMPLE_INTERVAL_MS) {
    lastSampleMs = millis();
    sampleSensors();
  }

  // CRITICAL mode: send immediately every 2 seconds (no waiting for interval)
  // NORMAL/ABNORMAL mode: respect report interval
  bool shouldForce = (currentPriority == SmartPacket::PRIORITY_HIGH);
  sendCurrentTelemetry(shouldForce);

  sendLocationSyncIfNeeded();
  retryPendingPacketsIfNeeded();

  // Check ACK timeouts
  checkAckTimeouts();

  // Handle serial commands for configuration
  if (Serial.available()) {
    String input = Serial.readStringUntil('\n');
    input.trim();
    handleSerialCommand(input);
  }
}

// ================= SERIAL CONFIG COMMANDS =================
void handleSerialCommand(String input) {
  if (input.length() == 0) return;

  Serial.println("\n>>> Command: " + input);
  String command = input;
  command.toUpperCase();

  if (command == "HELP") {
    Serial.println("=== AVAILABLE COMMANDS ===");
    Serial.println("HELP           - Show this help");
    Serial.println("LIST           - Show current sensor config");
    Serial.println("CLEAR          - Clear all sensor config");
    Serial.println("ADD,pin,type,sensor,label - Add sensor");
    Serial.println("META,lat,lon,distance - Update node location metadata");
    Serial.println("ID             - Show ESP32 hardware identity");
    Serial.println("");
    Serial.println("KEY MANAGEMENT:");
    Serial.println("SETKEYS,AES128=xxx,AUTH=yyy - Set AES(16char) + Auth keys");
    Serial.println("SHOWKEYS       - Show current keys (masked)");
    Serial.println("CLEARKEYS      - Reset keys to defaults");
    Serial.println("");
    Serial.println("Examples:");
    Serial.println("ADD,15,AI,DHT22,TempSensor");
    Serial.println("ADD,27,AI,WaterTemp,WaterTemp");
    Serial.println("ADD,34,AI,pH,pHSensor");
    Serial.println("ADD,35,AI,TDS,TDSensor");
    Serial.println("ADD,36,AI,Turbidity,TurbSensor");
    Serial.println("ADD,39,DI,Rain,RainSensor");
    Serial.println("");
    Serial.println("type: AI=Input (sensors), DI=Digital Input");
    Serial.println("sensor: DHT22, WaterTemp, pH, TDS, Turbidity, Rain");
    return;
  }

  if (command == "LIST") {
    Serial.println("=== CURRENT CONFIG ===");
    Serial.println("Count: " + String(configList.size()));
    for (size_t i = 0; i < configList.size(); i++) {
      auto c = configList[i];
      Serial.println("  " + String(i+1) + ". Pin:" + String(c.pin) +
                     " Type:" + c.type +
                     " Sensor:" + c.sensor +
                     " Label:" + c.label);
    }
    Serial.println("Hardware ID: " + runtimeHardwareId);
    Serial.println("Latitude: " + String(runtimeSettings.latitude, 6));
    Serial.println("Longitude: " + String(runtimeSettings.longitude, 6));
    Serial.println("Distance(m): " + String(runtimeSettings.distanceMeters, 1));
    Serial.println("Pending queue: " + String(pendingPackets.size()));
    return;
  }

  if (command == "CLEAR") {
    configList.clear();
    latestSegments.clear();
    Serial.println("Config cleared!");
    return;
  }

  if (command == "ID") {
    Serial.println("=== HARDWARE IDENTITY ===");
    Serial.println("Hardware ID (EUI-64): " + runtimeHardwareId);
    Serial.println("Chip model: " + String(ESP.getChipModel()));
    Serial.println("Chip revision: " + String(ESP.getChipRevision()));
    return;
  }

  if (command.startsWith("META,")) {
    String parts[4];
    int partIdx = 0;
    int start = 5;
    for (int i = 5; i <= input.length(); i++) {
      if (i == input.length() || input[i] == ',') {
        parts[partIdx] = input.substring(start, i);
        start = i + 1;
        partIdx++;
        if (partIdx >= 4) break;
      }
    }

    if (partIdx < 3) {
      Serial.println("ERROR: Invalid format. Use: META,lat,lon,distance");
      return;
    }

    runtimeSettings.latitude = parts[0].toFloat();
    runtimeSettings.longitude = parts[1].toFloat();
    runtimeSettings.distanceMeters = parts[2].toFloat();
    Serial.println("Node metadata updated.");
    return;
  }

  if (command.startsWith("SETKEYS,")) {
    // Format: SETKEYS,AES128=your16charkey,AUTH=yourauthkey
    String args = input.substring(8);
    bool aesSet = false;
    bool authSet = false;

    int aesPos = args.indexOf("AES128=");
    int authPos = args.indexOf("AUTH=");

    if (aesPos >= 0) {
      int aesEnd = args.indexOf(",", aesPos);
      if (aesEnd < 0) aesEnd = args.length();
      String aesKey = args.substring(aesPos + 7, aesEnd);
      aesKey.trim();
      if (aesSet = saveAesKey(aesKey)) {
        // Key saved
      }
    }

    if (authPos >= 0) {
      int authEnd = args.indexOf(",", authPos);
      if (authEnd < 0) authEnd = args.length();
      String authKey = args.substring(authPos + 5, authEnd);
      authKey.trim();
      if (authSet = saveAuthKey(authKey)) {
        // Key saved
      }
    }

    if (!aesSet && !authSet) {
      Serial.println("ERROR: Invalid format. Use: SETKEYS,AES128=your16charkey,AUTH=yourauthkey");
      Serial.println("Example: SETKEYS,AES128=SmartPonic123456,AUTH=AQUA77");
    } else {
      if (aesSet) Serial.println("AES key: " + runtimeAesKey);
      if (authSet) Serial.println("Auth key: " + runtimeAuthKey);
    }
    return;
  }

  if (command == "SHOWKEYS") {
    Serial.println("=== SECURE KEYS ===");
    Serial.println("AES key: " + runtimeAesKey);
    Serial.println("Auth key: " + runtimeAuthKey);
    return;
  }

  if (command == "CLEARKEYS") {
    clearSecureKeys();
    return;
  }

  if (command.startsWith("ADD,")) {
    // Format: ADD,pin,type,sensor,label
    String parts[4];
    int partIdx = 0;
    int start = 4;
    for (int i = 4; i <= input.length(); i++) {
      if (input[i] == ',' || i == input.length()) {
        parts[partIdx] = input.substring(start, i);
        start = i + 1;
        partIdx++;
        if (partIdx >= 4) break;
      }
    }

    if (partIdx < 3) {
      Serial.println("ERROR: Invalid format. Use: ADD,pin,type,sensor,label");
      return;
    }

