hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
    int pin = parts[0].toInt();
    String type = parts[1];
    type.toUpperCase();
    String sensor = canonicalSensorName(parts[2]);
    String label = parts[3];

    if (configList.size() >= MAX_SENSORS) {
      Serial.println("ERROR: Maximum sensor limit reached!");
      return;
    }

    if (!isSafePin(pin)) {
      Serial.println("ERROR: Pin " + String(pin) + " is not safe to use!");
      Serial.println("Safe pins: 4,13,15,16,17,21,22,25,26,27,32,33,34,35,36,39");
      return;
    }

    for (size_t i = 0; i < configList.size(); i++) {
      if (configList[i].pin == pin && configList[i].sensor == sensor) {
        Serial.println("ERROR: Duplicate sensor config detected!");
        return;
      }
    }

    configList.push_back({pin, type, sensor, label});

    // Initialize sensor if needed
    int idx = configList.size() - 1;
    if (sensor == "DHT22") {
      dhtSensors[idx] = new DHT(pin, DHT22);
      dhtSensors[idx]->begin();
    } else if (sensor == "WaterTemp") {
      oneWireSensors[idx] = new OneWire(pin);
      tempSensors[idx] = new DallasTemperature(oneWireSensors[idx]);
      tempSensors[idx]->begin();
    }

    if (type == "DO") {
      pinMode(pin, OUTPUT);
    } else {
      pinMode(pin, INPUT);
    }

    Serial.println("Sensor added: Pin " + String(pin) + " as " + sensor);
    return;
  }

  Serial.println("Unknown command. Type HELP for available commands.");
}

// ACK timeout check - basic implementation for the original Node firmware
// Since this version doesn't have ACK tracking, we provide a placeholder
// that clears ACK state after a timeout to prevent infinite waits
void checkAckTimeouts() {
  // Placeholder for ACK timeout checking
  // In a more complete implementation, this would check for pending ACKs
  // and reset waitingForAck state if timeout expires
}
